time = Time.new(2024, 1, 31, 12, 0, 0)
puts "1分後: #{time + 60}"  #=> 1分後: 2024-01-31 12:01:00 +0000
puts "1時間前: #{time - 60 * 60}"  #=> 1時間前: 2024-01-31 11:00:00 +0000
puts "1日前: #{time - 24 * 60 * 60}"  #=> 1日前: 2024-01-30 12:00:00 +0000
puts "30日後: #{time + 30 * 24 * 60 * 60}"  #=> 30日後: 2024-03-01 12:00:00 +0000
puts "365日後: #{time + 365 * 24 * 60 * 60}"  #=> 365日後: 2025-01-30 12:00:00 +0000

require 'date'

date = Date.new(2024, 1, 31)
puts "1日後: #{date + 1}"  #=> 1日後: 2024-02-01
puts "1日前: #{date.prev_day}"  #=> 1日前: 2024-01-30
puts "1か月後: #{date.next_month}"  #=> 1か月後: 2024-02-29
puts "3か月後: #{date << 3}"  #=> 3か月後: 2023-10-31
puts "2年後: #{date.next_year(2)}"  #=> 2年後: 2026-01-31
